#Если НЕ МобильныйАвтономныйСервер Тогда
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Перед("ПриКопировании")
Процедура А_ПриКопировании(ОбъектКопирования)
	
	ДатаСозданияУстановить();
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура А_ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСозданияУстановить();
	КонецЕсли;
	
КонецПроцедуры


Процедура ДатаСозданияУстановить()

	Если НЕ ЭтоГруппа Тогда
		Если ЭтоНовый() Тогда
			ДатаСоздания = ТекущаяДата();		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
#КонецЕсли